In [281]:
import pandas as pd
import numpy as np

# 1. Read the JSON file that you saved in ex02.
- One of the columns is a float, so let's define its format in Pandas using pd.options.display.float_format: floats should be displayed with two decimals.
- There are missing values from the Model; do not do anything with them.

In [282]:
df = pd.read_json('../data/auto.json')
pd.options.display.float_format = '{:.2f}'.format

# 2. Enrich the dataframe using a sample from that dataframe.
- Create a sample with 200 new observations using random_state = 21. 
    - The sample should not contain new combinations of the car number, make, and model, so the entire dataset will be consistent in this regard.

In [283]:
sample = df.sample(n=200, random_state=21)
sample = sample[['CarNumber', 'Make', 'Model']]
sample

        CarNumber        Make   Model
445  M0299X197RUS        Ford   Focus
22   83298C154RUS        Ford   Focus
93   H957HY161RUS        Ford   Focus
173   T941CC96RUS        Ford   Focus
697  H966HY161RUS        Ford   Focus
..            ...         ...     ...
14   8182XX154RUS        Ford   Focus
623   X796TH96RUS        Ford   Focus
498  T011MY163RUS        Ford   Focus
536   T341CC96RUS  Volkswagen  Passat
520   T119CT96RUS        Ford   Focus

[200 rows x 3 columns]

    - There are no restrictions on the refund and fines columns. You can randomly select a value from these columns and apply it to any car number.

In [284]:
refund_fines = df[['Refund', 'Fines']].sample(n=len(sample), random_state=21, replace=True)
sample = sample.reset_index(drop=True)
refund_fines = refund_fines.reset_index(drop=True)
sample[['Refund', 'Fines']] = refund_fines
sample

        CarNumber        Make   Model  Refund    Fines
0    M0299X197RUS        Ford   Focus       1  1500.00
1    83298C154RUS        Ford   Focus       2  4000.00
2    H957HY161RUS        Ford   Focus       1  4500.00
3     T941CC96RUS        Ford   Focus       2  2000.00
4    H966HY161RUS        Ford   Focus       2  1300.00
..            ...         ...     ...     ...      ...
195  8182XX154RUS        Ford   Focus       1  2000.00
196   X796TH96RUS        Ford   Focus       2   400.00
197  T011MY163RUS        Ford   Focus       1 12800.00
198   T341CC96RUS  Volkswagen  Passat       2   800.00
199   T119CT96RUS        Ford   Focus       2  2200.00

[200 rows x 5 columns]

- Concatenate the sample with the initial dataframe to create a new dataframe, concat_rows.

In [285]:
concat_rows = pd.concat([df, sample], ignore_index=True)
concat_rows.count()

CarNumber    925
Refund       925
Fines        925
Make         925
Model        914
dtype: int64

# 3. Enrich the concat_rows dataframe with a new column containing generated data.
- Create a series named "Year" with random integers from 1980 to 2019.
- Use np.random.seed(21) before generating the years.

In [286]:
np.random.seed(21)
year = np.random.randint(1980, 2019, size=len(concat_rows))
year = pd.Series(year, name = 'Year')
year

0      1989
1      1995
2      1984
3      2015
4      2014
       ...
920    1996
921    2002
922    1996
923    2012
924    1984
Name: Year, Length: 925, dtype: int32

- Concatenate the series with the data frame and name it fines.

In [287]:
fines = pd.concat([concat_rows, year], axis=1)
fines

        CarNumber  Refund    Fines        Make   Model  Year
0    Y163O8161RUS       2  3200.00        Ford   Focus  1989
1     E432XX77RUS       1  6500.00      Toyota   Camry  1995
2     7184TT36RUS       1  2100.00        Ford   Focus  1984
3    X582HE161RUS       2  2000.00        Ford   Focus  2015
4    92918M178RUS       1  5700.00        Ford   Focus  2014
..            ...     ...      ...         ...     ...   ...
920  8182XX154RUS       1  2000.00        Ford   Focus  1996
921   X796TH96RUS       2   400.00        Ford   Focus  2002
922  T011MY163RUS       1 12800.00        Ford   Focus  1996
923   T341CC96RUS       2   800.00  Volkswagen  Passat  2012
924   T119CT96RUS       2  2200.00        Ford   Focus  1984

[925 rows x 6 columns]

# 4. Enrich the dataframe with data from another dataframe.
- Create a new dataframe with car numbers and their owners. 
    - Get the most popular surnames in the US (you can find the file surname.json in the folder datasets).

In [288]:
surnames_data = pd.read_json('../../datasets/surname.json')
surnames_list = surnames_data[0].tolist()[1:]
surnames_list

['ADAMS',
 'ALLEN',
 'ALVAREZ',
 'ANDERSON',
 'BAILEY',
 'BAKER',
 'BENNETT',
 'BROOKS',
 'BROWN',
 'CAMPBELL',
 'CARTER',
 'CASTILLO',
 'CHAVEZ',
 'CLARK',
 'COLLINS',
 'COOK',
 'COOPER',
 'COX',
 'CRUZ',
 'DAVIS',
 'DIAZ',
 'EDWARDS',
 'EVANS',
 'FLORES',
 'FOSTER',
 'GARCIA',
 'GOMEZ',
 'GONZALEZ',
 'GRAY',
 'GREEN',
 'GUTIERREZ',
 'HALL',
 'HARRIS',
 'HERNANDEZ',
 'HILL',
 'HOWARD',
 'HUGHES',
 'JACKSON',
 'JAMES',
 'JIMENEZ',
 'JOHNSON',
 'JONES',
 'KELLY',
 'KIM',
 'KING',
 'LEE',
 'LEWIS',
 'LONG',
 'LOPEZ',
 'MARTIN',
 'MARTINEZ',
 'MENDOZA',
 'MILLER',
 'MITCHELL',
 'MOORE',
 'MORALES',
 'MORGAN',
 'MORRIS',
 'MURPHY',
 'MYERS',
 'NELSON',
 'NGUYEN',
 'ORTIZ',
 'PARKER',
 'PATEL',
 'PEREZ',
 'PETERSON',
 'PHILLIPS',
 'PRICE',
 'RAMIREZ',
 'RAMOS',
 'REED',
 'REYES',
 'RICHARDSON',
 'RIVERA',
 'ROBERTS',
 'ROBINSON',
 'RODRIGUEZ',
 'ROGERS',
 'ROSS',
 'RUIZ',
 'SANCHEZ',
 'SANDERS',
 'SCOTT',
 'SMITH',
 'STEWART',
 'TAYLOR',
 'THOMAS',
 'THOMPSON',
 'TORRES',
 'TURNER',
 'WALKER',
 'WARD',
 'WATSON',
 'WHITE',
 'WILLIAMS',
 'WILSON',
 'WOOD',
 'WRIGHT',
 'YOUNG']

      - Create a new series with the surnames. They should not contain special characters, such as commas or brackets. The count should equal the number of unique car numbers in the sample (use `random_state = 21`).

In [289]:
unique_CarNumbers = fines['CarNumber'].unique()
np.random.seed(21)
surnames = pd.Series(np.random.choice(surnames_list, size=len(unique_CarNumbers)))
surnames

0      RICHARDSON
1            ROSS
2          MORGAN
3          BAILEY
4           LOPEZ
          ...
526      CAMPBELL
527          HALL
528         BAKER
529          DIAZ
530        MORGAN
Length: 531, dtype: object

    - Create the dataframe `owners` with two columns: `CarNumber` and `SURNAME`.

In [290]:
owners = pd.DataFrame({
    'CarNumber': unique_CarNumbers,
    'SURNAME': surnames
})
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
526  O136HO197RUS    CAMPBELL
527  O22097197RUS        HALL
528  M0309X197RUS       BAKER
529  O673E8197RUS        DIAZ
530  8610T8154RUS      MORGAN

[531 rows x 2 columns]

   - Append five more observations to the `fines` dataframe. Come up with your own ideas for `CarNumber`, etc.

In [291]:
fines_1 = pd.DataFrame({
    'CarNumber': ['X999XX99RUS', 'Y888YY88RUS', 'Z777ZZ77RUS', 'C444CC44RUS', 'D333DD33RUS'],
    'Refund': [1.0, 2.0, 1.0, 2.0, 1.0],
    'Fines': [5000.0, 3000.0, 7000.0, 2000.0, 6000.0],
    'Make': ['Ford', 'Toyota', 'Skoda', 'Volkswagen', 'Ford'],
    'Model': ['Focus', 'Camry', 'Octavia', 'Golf', 'Focus'],
})
fines = pd.concat([fines, fines_1], ignore_index=True)

In [292]:
fines.count()

CarNumber    930
Refund       930
Fines        930
Make         930
Model        919
Year         925
dtype: int64

   - Delete the last 20 observations from the `owners` dataframe and add three new observations that are not the same as those added to the `fines` dataframe.

In [293]:
len(owners)

531

In [294]:
owners = owners[:-20]
new_owners = pd.DataFrame({
    'CarNumber': ['UNIQUE001', 'UNIQUE002', 'UNIQUE003'],
    'SURNAME': ['SMITH', 'JOHNSON', 'WILLIAMS']
})
owners = pd.concat([owners, new_owners], ignore_index=True)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
509  O50197197RUS      WRIGHT
510  7608EE777RUS        HILL
511     UNIQUE001       SMITH
512     UNIQUE002     JOHNSON
513     UNIQUE003    WILLIAMS

[514 rows x 2 columns]

- Join the two dataframes.
     - The new dataframe should contain **only** the car numbers that exist in **both** dataframes.

In [295]:
inner_join = pd.merge(fines, owners, on='CarNumber', how='inner')
inner_join

        CarNumber  Refund    Fines        Make   Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00        Ford   Focus 1989.00  RICHARDSON
1     E432XX77RUS    1.00  6500.00      Toyota   Camry 1995.00        ROSS
2     7184TT36RUS    1.00  2100.00        Ford   Focus 1984.00      MORGAN
3    X582HE161RUS    2.00  2000.00        Ford   Focus 2015.00      BAILEY
4    92918M178RUS    1.00  5700.00        Ford   Focus 2014.00       LOPEZ
..            ...     ...      ...         ...     ...     ...         ...
894  8182XX154RUS    1.00  2000.00        Ford   Focus 1996.00       SMITH
895   X796TH96RUS    2.00   400.00        Ford   Focus 2002.00      WATSON
896  T011MY163RUS    1.00 12800.00        Ford   Focus 1996.00     SANDERS
897   T341CC96RUS    2.00   800.00  Volkswagen  Passat 2012.00       PEREZ
898   T119CT96RUS    2.00  2200.00        Ford   Focus 1984.00        RUIZ

[899 rows x 7 columns]

     - The new dataframe should contain **all** the car numbers from **both** dataframes. (Outer Join)

In [296]:
outer_join = pd.merge(fines, owners, on='CarNumber', how='outer')
outer_join

        CarNumber  Refund    Fines   Make    Model    Year   SURNAME
0    704687163RUS    2.00  1400.00   Ford    Focus 2014.00     ADAMS
1    704787163RUS    2.00  2800.00   Ford    Focus 2005.00    MORGAN
2    704987163RUS    2.00  8594.59   Ford    Focus 2014.00  MITCHELL
3    705287163RUS    2.00  2000.00   Ford    Focus 1990.00     GOMEZ
4    705387163RUS    2.00   700.00   Ford    Focus 2005.00   STEWART
..            ...     ...      ...    ...      ...     ...       ...
928  Y973O8197RUS    1.00 34800.00   Ford    Focus 2013.00     YOUNG
929  Y973O8197RUS    1.00 69600.00   Ford    Focus 1989.00     YOUNG
930  Y973O8197RUS    2.00 15300.00   Ford    Focus 2009.00     YOUNG
931  Y973O8197RUS    2.00  6800.00   Ford    Focus 2014.00     YOUNG
932   Z777ZZ77RUS    1.00  7000.00  Skoda  Octavia     NaN       NaN

[933 rows x 7 columns]

     - The new dataframe should contain **only** the car numbers from the `fines` dataframe.

In [297]:
left_join = pd.merge(fines, owners, on='CarNumber', how='left')
left_join

        CarNumber  Refund   Fines        Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00 3200.00        Ford    Focus 1989.00  RICHARDSON
1     E432XX77RUS    1.00 6500.00      Toyota    Camry 1995.00        ROSS
2     7184TT36RUS    1.00 2100.00        Ford    Focus 1984.00      MORGAN
3    X582HE161RUS    2.00 2000.00        Ford    Focus 2015.00      BAILEY
4    92918M178RUS    1.00 5700.00        Ford    Focus 2014.00       LOPEZ
..            ...     ...     ...         ...      ...     ...         ...
925   X999XX99RUS    1.00 5000.00        Ford    Focus     NaN         NaN
926   Y888YY88RUS    2.00 3000.00      Toyota    Camry     NaN         NaN
927   Z777ZZ77RUS    1.00 7000.00       Skoda  Octavia     NaN         NaN
928   C444CC44RUS    2.00 2000.00  Volkswagen     Golf     NaN         NaN
929   D333DD33RUS    1.00 6000.00        Ford    Focus     NaN         NaN

[930 rows x 7 columns]

    - The new dataframe should contain **only** the car numbers from the `owners` dataframe. (Right Join)

In [298]:
right_join = pd.merge(fines, owners, on='CarNumber', how='right')
right_join

        CarNumber  Refund    Fines    Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00    Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00  1600.00    Ford    Focus 1999.00  RICHARDSON
2     E432XX77RUS    1.00  6500.00  Toyota    Camry 1995.00        ROSS
3     E432XX77RUS    2.00 13000.00  Toyota    Camry 1992.00        ROSS
4     7184TT36RUS    1.00  2100.00    Ford    Focus 1984.00      MORGAN
..            ...     ...      ...     ...      ...     ...         ...
897  7608EE777RUS    1.00  4000.00   Skoda  Octavia 2013.00        HILL
898  7608EE777RUS    2.00 20600.00   Skoda  Octavia 1987.00        HILL
899     UNIQUE001     NaN      NaN     NaN      NaN     NaN       SMITH
900     UNIQUE002     NaN      NaN     NaN      NaN     NaN     JOHNSON
901     UNIQUE003     NaN      NaN     NaN      NaN     NaN    WILLIAMS

[902 rows x 7 columns]

In [299]:
len(fines)

930

# 5. Create a pivot table from the `fines` dataframe. It should look like this (the values are the sums of the fines), but with all the years. The values may be different for you.

In [300]:
pivot_table = fines.pivot_table(
    values='Fines',
    index=['Make', 'Model'],
    columns='Year',
    aggfunc='sum',
    fill_value=0
)
pivot_table

Year                1980.00   1981.00  1982.00   1983.00   1984.00   1985.00  \
Make       Model
Ford       Focus   74994.59 306394.59 88994.59 163994.59 112500.00 262694.59
           Mondeo      0.00      0.00 46200.00      0.00      0.00      0.00
Skoda      Octavia  9094.59   1900.00  8894.59      0.00    500.00  10894.59
Toyota     Camry   12000.00      0.00 43600.00   1000.00   1000.00      0.00
           Corolla     0.00   6800.00     0.00  12800.00      0.00   6300.00
Volkswagen Golf    20800.00   8594.59  5000.00    200.00      0.00 168000.00
           Jetta       0.00   1000.00     0.00      0.00      0.00   9000.00
           Passat    900.00   4000.00     0.00   1100.00   8594.59      0.00
           Touareg     0.00      0.00     0.00      0.00      0.00      0.00

Year                1986.00   1987.00  1988.00   1989.00  ...   2009.00  \
Make       Model                                          ...
Ford       Focus   62200.00 161494.59 77772.93 168594.59  ... 128794.59
           Mondeo      0.00      0.00     0.00      0.00  ...      0.00
Skoda      Octavia     0.00  22600.00  5100.00   8594.59  ...      0.00
Toyota     Camry   19800.00      0.00     0.00    800.00  ...      0.00
           Corolla     0.00  54300.00     0.00   7800.00  ...   8594.59
Volkswagen Golf        0.00    500.00     0.00    300.00  ...      0.00
           Jetta       0.00      0.00 46000.00    500.00  ...      0.00
           Passat  16000.00   2000.00  8594.59      0.00  ...  21800.00
           Touareg     0.00      0.00     0.00      0.00  ...   5800.00

Year                 2010.00   2011.00   2012.00   2013.00  2014.00   2015.00  \
Make       Model
Ford       Focus   111100.00 116994.59 143789.17 292183.76 74083.76 171500.00
           Mondeo       0.00      0.00      0.00  41100.00     0.00      0.00
Skoda      Octavia   4000.00   3000.00   1700.00  11800.00 52600.00  16394.59
Toyota     Camry    22400.00      0.00   7500.00      0.00     0.00      0.00
           Corolla   6000.00   1000.00      0.00      0.00     0.00   7500.00
Volkswagen Golf         0.00      0.00      0.00      0.00 13900.00   5300.00
           Jetta        0.00      0.00      0.00      0.00     0.00      0.00
           Passat    9500.00      0.00    800.00   1600.00  3800.00      0.00
           Touareg      0.00      0.00      0.00      0.00     0.00      0.00

Year                 2016.00   2017.00   2018.00
Make       Model
Ford       Focus   102789.17 102894.59  99500.00
           Mondeo       0.00   8600.00      0.00
Skoda      Octavia  35700.00   2400.00 153200.00
Toyota     Camry     8594.59      0.00      0.00
           Corolla      0.00   9200.00      0.00
Volkswagen Golf         0.00      0.00   5000.00
           Jetta        0.00      0.00      0.00
           Passat       0.00      0.00      0.00
           Touareg      0.00      0.00      0.00

[9 rows x 39 columns]

# 6. Save both the `fines` and `owners` dataframes to CSV files without an index.

In [301]:
fines['Year'].iloc[-5:] = [2020, 2021, 2022, 2023, 2024]

fines.to_csv('../data/fines.csv', index=False)
owners.to_csv('../data/owners.csv', index=False)

C:\Users\User\AppData\Local\Temp\ipykernel_19800\2582344422.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  fines['Year'].iloc[-5:] = [2020, 2021, 2022, 2023, 2024]
C:\Users\User\AppData\Local\Temp\ipykernel_19800\2582344422.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fines['Year'].iloc[-5:] = [2020, 2021, 2022, 2023, 2024]